---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.EnergyAnalysisPercentageSkylights
source: html/e0d26cc9-3926-acda-d0d6-8e5a74528c58.htm
---
# Autodesk.Revit.DB.ParameterTypeId.EnergyAnalysisPercentageSkylights Property

"Target Percentage Skylights"

## Syntax (C#)
```csharp
public static ForgeTypeId EnergyAnalysisPercentageSkylights { get; }
```